* HH 529-II,III reply to referee

** Re-derive the shock jump conditions
+ I am having doubts about whether to use the adiabatic or isothermal sound speed.
+ The shock adiabat is given by
  \[
  \frac{\gamma}{\gamma - 1} (P_2 v_2 - P_1 v_1) = 0.5 (v_1 + v_2) (P_2 - P_1)
  \]
+ But where v_1, v_2 are specific volumes = 1/\rho
+ c_s = (\gamma P / \rho)^{1/2}
+ P = n k T = \rho c_s^2 / \gamma = (R/\mu) \rho T
+ c_s^2 = \gamma P V
*** Working through Zel'dovich & Raizer
+ The whole chapter is available in Google Books
  + Again, V = 1/\rho is specific volume
+ upstream velocity
  + u_0^2 = V_0^2 (p_1 - p_0) / (V_0 - V_1)
+ post-shock velocity
  + u_1^2 = V_1^2 (p_1 - p_0) / (V_0 - V_1)

*** Using stuff from Wikipedia
+ The page on [[https://en.wikipedia.org/wiki/Normal_shock_tables][Normal shock tables]] is useful
  + Except M_1, M_2 on that page are M_0, M_1 in our notation
+ They have (in my notation)
  \[
  M_1^2 = \frac{(\gamma - 1) M_0^2 + 2} {2\gamma M_0^2 - (\gamma - 1)}
  \]
+ Which for \gamma = 5/3 yields
  \[
  M_1^2 = \frac{M_0^2 + 3} {5 M_0^2 - 1}
  \]
+ Which is the same as I had before, so this is clearly the adiabatic Mach number
+ For T_1/T_0 we have dependence on
  + G1 \equiv (\gamma-1)/2 = 1/3
  + G2 \equiv 2\gamma/(\gamma-1) = 5
  + 1/(G1 + G2) = 3/16
    \[
    \frac{T_1}{T_0} = (1 + G1 M^2_0) (G2 - M_0^{-2}) / (G1 + G2)
    \]
  + For \gamma=5/3 this gives T_1/T_0 = (3 + M_0^2) (5 - 1/M_0^2) / 16
    + Put M_0 = 1 + x
      + M_0^2 = 1 + 2 x
      + 1/M_0^2 = 1 - 2x
      + (3 + M_0^2) (5 - 1/M_0^2) / 16 = (4 + 2x) (4 + 2x) /16
        = (16 + 16 x) / 16 = 1 + x = M_0
    + Or just multiply out:
      + (15 + 5M^2 - 3/M^2 - 1)/16
      + No, that does not help
 
  


*** So what does that mean for the rest of it?
+ Just that the isothermal Mach number is sqrt(\gamma) = 1.291 times larger than the adiabatic Mach number.
+ So the post-shock density is the same: n_1/n_0 = 4 M_0^2 / (M_0^2 + 3)
+ But the post-cooling density is higher n_2/n_0 = \gamma M_0^2 = 5 M_0^2 / 3
+ Repeat the table, but with adiabatic Mach number
  |   M_0 | T_1/T_0 | n_1/n_0 |  n_2/n_0 |  h/r |  H/r |
  |------+-------+-------+--------+------+------|
  | 1.01 |  1.01 |  1.01 |   1.70 | 0.38 | 0.50 |
  |  1.1 |  1.10 |  1.15 |   2.02 | 0.35 | 0.46 |
  |  1.2 |  1.19 |  1.30 |   2.40 | 0.32 | 0.42 |
  |  1.5 |  1.49 |  1.71 |   3.75 | 0.26 | 0.36 |
  |  2.0 |  2.08 |  2.29 |   6.67 | 0.19 | 0.30 |
  |  3.0 |  3.67 |  3.00 |  15.00 | 0.13 | 0.26 |
  |  4.0 |  5.86 |  3.37 |  26.67 | 0.10 | 0.25 |
  |  6.0 | 12.12 |  3.69 |  60.00 | 0.06 | 0.23 |
  |  8.0 | 20.87 |  3.82 | 106.67 | 0.05 | 0.23 |
  | 10.0 | 32.12 |  3.88 | 166.67 | 0.04 | 0.23 |
  #+TBLFM: $2=(3 + $1**2) (5 - 1/$1**2)/16;f2::$3=4 $1**2/($1**2 + 3);f2::$4=5 $1**2 / 3;f2::$5=0.5 / $1 sqrt(5/3) ;f2::$6=0.5 $1 / $3 sqrt($2) ;f2


*** Working out the thickness of the equilibrium shocked layer
+ Assume a steady state, where gas flows out sideways at a fraction \eta of the isothermal sound speed
  + Mdot in = \pi r^2 n_0 m M_0 c_s
  + Mdot out = 2 \pi r h n_2 m \eta c_s / \gamma^{1/2}
  + h/r = (1/2) n_0 M_0 \gamma^{1/2} / n_2 \eta = 1 / 2 M_0 \gamma^{1/2} \eta
  + This is given above
+ Version with no cooling, H
  + If there is no cooling, then we need to use n_1 for the density, but the speed will be higher by a factor of sqrt(T_1/T_0)
  + Mdot out = 2 \pi r h n_1 m \eta c_s sqrt(T_1/T_0)
  + H/r = (1/2) n_0 M_0 / n_1 sqrt(T_1/T_0) \eta
*** The cooling length vs the shell thickness
+ Apparently this is 3 u_1 k (T_1 - T_0) / n_1 [\Lambda(T_1) - \Gamma(T_1)]
  + Note that I changed T_1 to (T_1 - T_0) since we only need to get down to the equilibrium T, not to zero
+

#+begin_src python :return tab
  import numpy as np
  from matplotlib import pyplot as plt
  import seaborn as sns
  sns.set_color_codes("deep")

  figfile = "cooling-length.pdf"

  T0 = 8500
  CS = 13.7
  ARCSEC = 410 * 1.49597870691e13
  R = 1.63 # outflow radius in arcsec (GIVES 1e16 cm)
  MU_E = 1.24                     # Mean mass per electron
  M_H = 1.67262158e-24            # Hydrogen mass

  # Mach number
  mach = np.array([
      1.01, 1.1, 1.2, 1.5, 2.0, 2.5, 3.0, 3.5, 4.0, 4.5, 5.0, 5.5,
      6.0, 7.0, 8.0, 9.0, 10.0, 12.0,
      15.0, 20.0
  ])
  # pre-shock velocity
  v0 = mach*CS
  # initial compression ratio
  n1_n0 = 4*mach**2 / (mach**2 + 3)
  # initial post-shock velocity
  v1 = v0 / n1_n0
  # post-shock temperature ratio
  T1_T0 = (3 + mach**2) * (5 - 1/mach**2) / 16
  # Cooling
  Lam1 = 3.3e-24 * (T1_T0 * T0 / 1e4)**2.3
  Lam2 = 1e-20 / (T1_T0 * T0 / 1e4)
  k = 3
  Lambda = (Lam1**(-k) + Lam2**(-k))**(-1/k)
  Gamma = (T0/1e4)**2.8 * 3.3e-24 / np.sqrt(T1_T0 * T0 / 1e4)
  Lambda_0 = 3.3e-24 * (T0 / 1e4)**2.3

  # Final compression
  n2_n0 = (5./3.) * mach**2

  n2 = 1e4
  n0 = n2 / n2_n0
  n1 = n0 * n1_n0

  # Cooling length in cm
  dcool = 3*(1e5 * v1) * 1.3806503e-16 * (T1_T0 - 1.0)*T0 / (n1 * (Lambda - Gamma))
  # shell thickness in cm
  h = R*ARCSEC / (mach * 2 * np.sqrt(5./3.))
  # alternative shell thickness if cooling inefficient
  H =  R*ARCSEC * mach / (2 * T1_T0**0.5 * n1_n0)

  # KE flux through shock
  ke_flux = 0.5 * MU_E * M_H * n0 * (v0 * 1e5)**3
  # Radiative flux from shell
  shell_flux = n2**2 * h * Lambda_0
  # Radiative flux from cooling zone
  cool_flux = n1**2 * np.minimum(dcool, H) * Lambda
  data = {
      "M_0" : mach,
      "u_0" : np.round(v0, 1),
      "u_1" : np.round(v1, 1),
      "u_2" : np.round(v0/n2_n0, 1),
      "T_1" : np.round(T1_T0*T0/1000, 1),
      "d_cool": np.round(dcool/ARCSEC, 3),
      "h": np.round(h/ARCSEC, 3),
      "H": np.round(H/ARCSEC, 3),
      "n_0":  np.round(n0),
      "n_1":  np.round(n1),
      # "n_2":  np.round(n2*np.ones_like(n0)),
      "shock/shell": np.round(ke_flux / shell_flux, 4),
      "cool/shell": np.round(cool_flux / shell_flux, 4),
  }

  tab = [list(data.keys()), None] + list(zip(*data.values()))
#+end_src

#+RESULTS:
|   M_0 |    u_0 |   u_1 |  u_2 |     T_1 |  d_cool |     h |     H |     n_0 |     n_1 | shock/shell | cool/shell |
|------+-------+------+-----+--------+--------+-------+-------+--------+--------+-------------+------------|
| 1.01 |  13.8 | 13.6 | 8.1 |    8.6 |  0.021 | 0.625 | 0.807 | 5882.0 | 5970.0 |      0.0186 |      0.012 |
|  1.1 |  15.1 | 13.1 | 7.5 |    9.3 |   0.02 | 0.574 | 0.744 | 4959.0 | 5701.0 |       0.022 |      0.014 |
|  1.2 |  16.4 | 12.7 | 6.8 |   10.2 |   0.02 | 0.526 |  0.69 | 4167.0 | 5405.0 |      0.0262 |     0.0163 |
|  1.5 |  20.5 | 12.0 | 5.5 |   12.7 |  0.019 | 0.421 | 0.583 | 2667.0 | 4571.0 |      0.0409 |     0.0241 |
|  2.0 |  27.4 | 12.0 | 4.1 |   17.7 |   0.02 | 0.316 | 0.495 | 1500.0 | 3429.0 |      0.0728 |     0.0407 |
|  2.5 |  34.2 | 12.7 | 3.3 |   23.8 |  0.022 | 0.253 | 0.451 |  960.0 | 2595.0 |      0.1137 |     0.0627 |
|  3.0 |  41.1 | 13.7 | 2.7 |   31.2 |  0.024 |  0.21 | 0.426 |  667.0 | 2000.0 |      0.1638 |     0.0901 |
|  3.5 |  47.9 | 14.9 | 2.3 |   39.8 |  0.026 |  0.18 |  0.41 |  490.0 | 1574.0 |      0.2229 |      0.123 |
|  4.0 |  54.8 | 16.3 | 2.1 |   49.8 |  0.027 | 0.158 |   0.4 |  375.0 | 1263.0 |      0.2911 |     0.1612 |
|  4.5 |  61.6 | 17.7 | 1.8 |   61.1 |  0.029 |  0.14 | 0.392 |  296.0 | 1032.0 |      0.3685 |     0.2047 |
|  5.0 |  68.5 | 19.2 | 1.6 |   73.8 |   0.03 | 0.126 | 0.387 |  240.0 |  857.0 |      0.4549 |     0.2534 |
|  5.5 |  75.4 | 20.7 | 1.5 |   87.7 |  0.032 | 0.115 | 0.383 |  198.0 |  722.0 |      0.5504 |     0.3073 |
|  6.0 |  82.2 | 22.3 | 1.4 |  103.0 |  0.037 | 0.105 |  0.38 |  167.0 |  615.0 |      0.6551 |     0.3664 |
|  7.0 |  95.9 | 25.4 | 1.2 |  137.6 |  0.069 |  0.09 | 0.376 |  122.0 |  462.0 |      0.8916 |     0.5002 |
|  8.0 | 109.6 | 28.7 | 1.0 |  177.4 |  0.163 | 0.079 | 0.374 |   94.0 |  358.0 |      1.1646 |     0.6546 |
|  9.0 | 123.3 | 32.0 | 0.9 |  222.6 |  0.361 |  0.07 | 0.372 |   74.0 |  286.0 |      1.4739 |     0.8298 |
| 10.0 | 137.0 | 35.3 | 0.8 |  273.0 |  0.739 | 0.063 |  0.37 |   60.0 |  233.0 |      1.8196 |     0.5136 |
| 12.0 | 164.4 | 42.0 | 0.7 |  389.9 |  2.584 | 0.053 | 0.369 |   42.0 |  163.0 |      2.6203 |     0.2109 |
| 15.0 | 205.5 | 52.1 | 0.5 |  605.1 | 12.076 | 0.042 | 0.367 |   27.0 |  105.0 |      4.0942 |     0.0703 |
| 20.0 | 274.0 | 69.0 | 0.4 | 1069.9 | 89.067 | 0.032 | 0.366 |   15.0 |   60.0 |      7.2785 |     0.0169 |
*** Interpretation of the above table
+ The cooling length is remarkably constant for the low-velocity shocks
  + Up to Mach number of 6: about 80 km/s
  + That is the point where we get the minimum shell thickness: h + d_cool = 0.1 arcsec
  + This is for R = 1 arcsec, so relative thickness is about 10%
+ For faster shocks
** Insights from the JaneWR shock models
+ These are for shocks between 68 and 153 km/s
+ They are matched to the same value of n_2 when it has cooled back down to the equilibrium T
+ In all cases, the [O III] comes from the part of the cooling zone where 10 kK < T < 40 kK, which is just before it gets back to the equilibrium T
+ The summed [O III] emission from the cooling zone is higher in the slower shocks
+ This is because the gas has a slower exhaust for higher Mach number shocks M \to 1/M
  + And so the cooling layer is thinner for the higher-M shocks  because dx \approx u_2 t_cool
  + I thought there was something else going on too, but that is just because I had not put the distances in physical units properly - all sorted now
+ The post-shock T exceeds 20,000 K for M = 2.3 => u_0 \approx 30 km/s
+ It exceeds 40,000 K for M = 3.5 => u_0 \approx 50 km/s
+ So this will give the following regimes
  1. u_0 < 30 km/s (T_1 = 10 \to 20,000 K)
     - [O III] from all the cooling zone
     - Relative contribution to [O III] = shock/shell \propto M^2 (climbs to about 10%)
  2. 30 < u_0 < 50 km/s (T_1 = 20 \to 50,000 K)
     - All of cooling zone still emits [O III], but it starts to be a smaller fraction
     - Other coolants, such as C III, N III, C IV become more important (UV lines)
     - Relative contribution to [O III] has a maximum at about 50 km/s of about 15%
  3. 50 < u_0 < 120 km/s (T_1 = 50 \to 200,000 K)
     - Cooling predominantly from He II
       - That is what the Cloudy output files seem to be saying, but that seems prima facie unlikely
     - 
** Shock versus shell emission
+ This is what we implement above in the python program
+ Shock emission
  \[
  F_{\text{shock}} = 0.5 \rho_0 u_0^3
  \]
+ Shell emission
  \[
  F_{\text{shell}} = (\rho_2 / \mu m_{\text{H}} )^2 \Lambda_0 h 
  \]
+ With
  + \(h = 0.387 R / \eta M\)
  + (\rho_0 = \rho_2 / \gamma M^2)
  + \(u_0 = M c_s\)
+ Working
  + F_1 = 0.5 \rho_2 M^3 c_s^3 / \gamma M^2 = 0.3 \rho_2 M c_s^3
  + F_2 = (\rho_2^2 R / M) 0.387 \Lambda_0 / \eta (\mu m_H)^2
  + F_1/F_2 = 0.775 M^2 c_s^3 \eta \mu m_h /(n_2 R \Lambda_0)
  + Check units:
    + Numerator: (cm/s)^3 g = g cm^3 s^-3
    + Denominator: cm^-3 cm erg cm^3 s^-1
      + erg = g cm^2 s^-2
      + => cm g cm^2 s^-2 s^-1 = g cm^3 s^-3
+ Typical values:
  + n_2 = 10,000 pcc
  + R = 1 arcsec = 6e15 cm, but take 1e16 instead
  + \Lambda_0 = 2.3e-24
  + c_s = 13.7e5 cm/s
  + \mu = 0.62
    + *NO* This \mu is different from the mean mass per particle
    + It should be the mean mass per electron, which is \mu_e = (1 + 4 y)/(1 + y) = 2\mu if He is singly ionized
    + For y = 0.087 this gives \mu_e = 1.24
  + F_1/F_2 = 0.018 M^2 \eta (n_2 / 1e4 pcc)^-1 (R / 1e16 pcc)^-1 (\Lambda_0 / 2.3e-24)^{-1}
+ So the ratio is
  \[
  \frac{F_{\text{shock}}}{F_{\text{shell}}}
  = 0.018 M^2
  \left( \frac{n_2}{\SI{1e4}{cm^{-3}}} \right)^{-1}
  \left( \frac{R}{\SI{1e16}{cm}} \right)^{-1}
  \left( \frac{\Lambda_0}{\SI{2.3e-24}{erg.cm^3.s^{-1}}} \right)^{-1}
  \]



** Parameters of the HH 529 II and III shocks
+ There are two possibilities for the shocks
  1. They may be propagating into the nebula
  2. They may be internal working surfaces in the jet beam
+ From HH 529 III we get a total speed of hypot(35, 57) = 67 km/s at an inclination of 60 deg from the plane of the sky
+ From HH 529 II, we have
  | comp | Vr       | Vt       | V            | i            |
  |------+----------+----------+--------------+--------------|
  | II a | 50 +/- 5 | 21 +/- 9 | 54.2 +/- 5.8 | 67.2 +/- 9.0 |
  | II b | 57 +/- 5 | 26 +/- 5 | 62.6 +/- 5.0 | 65.5 +/- 4.6 |
  #+TBLFM: $4=sqrt($2**2 + $3**2);f1::$5=arctan($2/$3);f1
+ These are consistent with what is in the paper: about 60 km/s for HH 529 II





*** Post-shock temperature and density
\[
T = \frac{3 \mu m_p}{16 k} V^2 
\]

|  V |   \Delta T |   M^2 |
|----+-------+------|
| 20 | 5.9e3 |  2.8 |
| 30 | 1.3e4 |  6.3 |
| 40 | 2.4e4 | 11.1 |
| 50 | 3.7e4 | 17.4 |
| 60 | 5.3e4 |   25 |
| 70 | 7.2e4 | 34.0 |
| 80 | 9.4e4 | 44.4 |
| 90 | 1.2e5 | 56.3 |
#+TBLFM: $2=3 0.5 1.3 $mp ($1 $km)**2 / 16 $k ; s2::$3=($1/12)**2 ; f1

So, on the assumption of a terminal bow shock, we get a Mach number of around 5 to 6 and a post-shock T of around 60,000 K, with a compression factor of 30

For an internal working surface, such as for HH 529-II, the \alpha ratio should be of order unity, whereas \beta is probably \ge 0.5.  If we take \alpha = 1, and \beta = 0.5, then the inner and outer shock velocities are 1/3 of the WS velocity, so about 20 km/s: M = 2.

This is consistent with the relatively small velocity width of the HH 529 II profile. 

Compare with
\[
c^2 = k T_0 / \mu m_H \Rightarrow T_0 = \mu m_H c^2 / k 
\]
so that
\[
\frac{T}{T_0} = 1 + \frac{3}{16} M^2
\]

*** 

*** Mach angle
+ Compare width with distance from source (in Orion S?)
+ This can give a Mach angle, which could restrict the jet velocity
+ Except that hoop stresses in a magnetized jet could keep it from expanding
*** Different velocities
+ Ambient velocity V_a
+ Jet velocity V_j
+ Working surface velocity V_ws
+ V_j > V_ws > V_a
+ n_a (V_ws - V_a)^2 = n_j (V_j - V_ws)^2 = n_ws c_0^2
+ Put \alpha = n_j / n_a
+ put \beta = V_a / V_j
+ put u = V_ws / V_j
+ n_a V_j^2 (u - \beta)^2 = \alpha n_a V_j^2 (1 - u)^2
  + (u - \beta)^2 = \alpha (1 - u)^2
  + u^2 - 2\beta u + \beta^2 = \alpha - 2\alpha u + \alpha u^2
  + (1 - \alpha) u^2 + 2(\alpha - \beta) u + (\beta^2 - \alpha) = 0
+ u = [-2(\alpha - \beta) \pm sqrt(4(\alpha - \beta)^2 - 4 (1 - \alpha) (\beta^2 - \alpha))] / 2 (1 - \alpha)
  + u = [-(\alpha - \beta) \pm sqrt(\alpha^2 - 2\alpha\beta + \beta^2 - \beta^2 + \alpha + \alpha\beta^2 - \alpha^2) ] / (1 - \alpha)
  + u = [-(\alpha - \beta) \pm (1 - \beta) sqrt(\alpha) ] / (1 - \alpha)
  + u = [(1 - \beta) \alpha^{1/2} - (\alpha - \beta)] / (1 - \alpha)
+ [X] *try again with added sound speed*
  + n_a [(V_ws - V_a)^2 + c_0^2/\gamma] = n_j [(V_j - V_ws)^2 + c_0^2/\gamma] = n_ws c_0^2/\gamma
  + same but use M = V_j/c_0
    + Although actually, what is observed is Mach number of the WS, which is M = u V_j/c_0
    + So, we divide through by n_a V_j^2, using c_0^2/\gamma V_j^2 = u^2/\gamma M^2
    + /From now on, I write M^2 instead of \gamma M^2, so M is the isothermal Mach number/
  + (u - \beta)^2 + u^2/M^2 = \alpha [(1 - u)^2 + u^2/M^2]
  + u^2 - 2\beta u + \beta^2 + u^2/M^2 = \alpha - 2\alpha u + \alpha u^2 + \alpha u^2/M^2
  + (1 - \alpha) (1 + 1/M^2) u^2 + 2(\alpha - \beta) u + (\beta^2 - \alpha) = 0
  + u = [-(\alpha - \beta) \pm sqrt(\alpha^2 - 2\alpha\beta + \beta^2 + (-\beta^2 + \alpha + \alpha\beta^2 - \alpha^2) (1 + 1/M^2)) ] / (1 - \alpha) (1 + 1/M^2)
  + u = [-(\alpha - \beta) \pm sqrt(\alpha (1 - \beta)^2 - (1 - \alpha) (\beta^2 - \alpha) / M^2)] / [(1 - \alpha) (1 + 1/M^2)]
  + u = [sqrt(\alpha (1 - \beta)^2 - (1 - \alpha) (\beta^2 - \alpha) / M^2) - (\alpha - \beta)] / [(1 - \alpha) (1 + 1/M^2)]
  + /check what happens for \beta = 0/
    + This is a simpler case and will let us see why there is no apparent solution for high \alpha
    + n_a [V_ws^2 + c_0^2] = n_j [(V_j - V_ws)^2 + c_0^2] = n_ws c_0^2
    + u^2 (1 + 1/M^2) = \alpha [(1 - u)^2 + u^2/M^2]
    + \alpha = u^2 (1 + 1/M^2) /  [(1 - u)^2 + u^2/M^2]
      + Put u = 1 => \alpha = (M^2 + 1)
    + *Mow I have the answer* For larger density contrasts than this, the thermal pressure of the jet cannot be balanced by any ram pressure of the environment
    + So the maximum \alpha for general \beta is given by
      + \alpha = 1 + (1 - \beta)^2 M^2 
+ Special case of \alpha = 1
  + This is singular, so do an expansion:
    + \alpha = 1 + \varepsilon
    + u = [(1 - \beta) (1 + 0.5\varepsilon) - (1 - \beta) - \varepsilon] / (-\varepsilon)
    + u = [1 - 0.5 (1 - \beta)] = 0.5 (1 + \beta)
    + Same as using l'Hôpital's rule
    + V_1s / V_WS = (1 - \beta) / (1 + \beta)
    + V_2s / V_WS = (1 - \beta) / (1 + \beta)
    + So the two shock velocities are the same
    + So, in order for them both to be supersonic, we need
      + M (1 - \beta) / (1 + \beta)  > 1
      + (1 + \beta) < M (1 - \beta)
      + \beta < (M - 1) / (M + 1)
      + E.g,, with M = 5, we have \beta < 2/3

|     \alpha |    \beta | M |             u |       (1 - u)/u |       (u - \beta)/u |
|-------+------+---+---------------+-----------------+-----------------|
|  0.01 |    0 | 6 |          0.09 |           10.11 |            1.00 |
|   0.1 |    0 | 6 |          0.24 |            3.17 |            1.00 |
|   0.3 |    0 | 6 |          0.35 |            1.86 |            1.00 |
|  1.01 |    0 | 6 |          0.50 |            1.00 |            1.00 |
|   1.5 |    0 | 6 |          0.55 |            0.82 |            1.00 |
|     2 |    0 | 6 |          0.59 |            0.69 |            1.00 |
|   2.5 |    0 | 6 |          0.62 |            0.61 |            1.00 |
|   3.0 |    0 | 6 |          0.64 |            0.56 |            1.00 |
|   7.0 |    0 | 6 |          0.74 |            0.35 |            1.00 |
|  10.0 |    0 | 6 |          0.79 |            0.27 |            1.00 |
| 100.0 |    0 | 6 | (0.98, -0.13) |  (2.8e-3, 0.13) |            1.00 |
|-------+------+---+---------------+-----------------+-----------------|
|  0.01 | 0.25 | 6 |          0.30 |            2.33 |            0.17 |
|   0.1 | 0.25 | 6 |          0.42 |            1.38 |            0.40 |
|  0.25 | 0.25 | 6 |          0.49 |            1.04 |            0.49 |
|  1.01 | 0.25 | 6 |          0.63 |            0.59 |            0.60 |
|   3.0 | 0.25 | 6 |          0.74 |            0.35 |            0.66 |
|  10.0 | 0.25 | 6 |          0.86 |            0.16 |            0.71 |
| 100.0 | 0.25 | 6 | (0.98, -0.15) | (-3.0e-3, 0.15) |   (0.75, -0.04) |
|-------+------+---+---------------+-----------------+-----------------|
|  0.01 |  0.5 | 6 |  (0.48, 0.06) |   (1.05, -0.26) |   (-0.03, 0.13) |
|   0.1 |  0.5 | 6 |          0.59 |            0.69 |            0.15 |
|   0.3 |  0.5 | 6 |          0.66 |            0.52 |            0.24 |
|   0.5 |  0.5 | 6 |          0.70 |            0.43 |            0.29 |
|  1.01 |  0.5 | 6 |          0.75 |            0.33 |            0.33 |
|   2.0 |  0.5 | 6 |          0.81 |            0.23 |            0.38 |
|   3.0 |  0.5 | 6 |          0.84 |            0.19 |            0.40 |
|  10.0 |  0.5 | 6 |          1.00 |            0.00 |            0.50 |
| 100.0 |  0.5 | 6 | (0.98, -0.16) | (-6.1e-3, 0.16) |   (0.50, -0.08) |
|-------+------+---+---------------+-----------------+-----------------|
|  0.01 | 0.75 | 6 |  (0.73, 0.12) |   (0.33, -0.22) | (-3.7e-4, 0.16) |
|   0.1 | 0.75 | 6 |  (0.70, 0.08) |   (0.41, -0.16) |   (-0.06, 0.12) |
|   0.3 | 0.75 | 6 |          0.79 |            0.27 |            0.05 |
|  0.75 | 0.75 | 6 |          0.85 |            0.18 |            0.12 |
|  1.01 | 0.75 | 6 |          0.88 |            0.14 |            0.15 |
|   3.0 | 0.75 | 6 |          0.98 |            0.02 |            0.23 |
|  10.0 | 0.75 | 6 | (1.00, -0.14) |   (-0.02, 0.14) |   (0.26, -0.10) |
| 100.0 | 0.75 | 6 | (0.98, -0.16) | (-6.1e-3, 0.16) |   (0.25, -0.12) |
#+TBLFM: $4=( sqrt($1 (1 - $2)**2 - (1 - $1) ($2**2 - $1) / $3**2)  - ($1 - $2))/(1 - $1) (1 + 1/$3**2);f2::$5=(1 - $4)/$4;f2::$6=($4 - $2)/$4;f2

+ So u is the speed of WS in terms of jet speed
+ 4th column gives inner shock jump in terms of WS speed
+ 5th column gives outer shock jump in terms of WS speed
**** Graph of the velocities versus \alpha

#+begin_src python :results file :return figfile
  import numpy as np
  from matplotlib import pyplot as plt
  import seaborn as sns
  sns.set_color_codes("bright")

  figfile = "shock-velocities.pdf"
  alpha = np.logspace(-1.5, 1.5, 500)
  betas = [0.0, 0.25, 0.50, 0.75]

  VWS = 65.0                      # Velocity of working surface
  CS = 13.7                       # Adiabatic sound speed
  GAMMA = 5./3.

  fig, [axu, axi, axo] = plt.subplots(
      3,
      1,
      sharex=True,
      figsize=(4, 5),
  )

  styles = [
      dict(lw=0.7, color=(0.2, 0.1, 0.05), alpha=1.0),
      dict(lw=1.0, color=(0.5, 0.3, 0.1), alpha=1.0),
      dict(lw=1.4, color=(0.7, 0.45, 0.15), alpha=1.0),
      dict(lw=2.0, color=(0.8, 0.5, 0.2), alpha=1.0),
  ]
  # isothermal Mach number
  M = np.sqrt(GAMMA)*VWS/CS

  # Example models to plot
  # Structure [ [ALPHA, BETA, COLOR], ... ]
  examples = [
      [7.0, 0.0, "c"],
      [1.5, 0.0, "b"],
      [0.5, 0.5, "r"],
  ]

  def ufunc(alpha):
      "Calculate V_ws / V_jet"
      return (np.sqrt(alpha*(1 - beta)**2 - (1 - alpha)*(beta**2 - alpha)/M**2)
              - (alpha - beta)) / ((1 - alpha) * (1 + 1.0/M**2))

  def Vifunc(u):
      "Velocity of (inward-facing) jet shock"
      return VWS*(1 - u)/u

  def Vofunc(u):
      "Velocity of (outward-facing) bow shock"
      return VWS*(u - beta)/u

  for beta, style in zip(betas, styles):
      # u = ((1 - beta)*np.sqrt(alpha) - (alpha - beta)) / (1 - alpha)
      u = ufunc(alpha)
      Vi = Vifunc(u)
      Vo = Vofunc(u)
      m = u <= 1.0
      axu.plot(alpha[m], u[m], **style)
      m = Vi > -CS
      axi.plot(alpha[m], Vi[m], zorder=-1, label=fr"$\beta = {beta:.2f}$", **style)
      m = Vo > -CS
      axo.plot(alpha[m], Vo[m], zorder=-1, **style)

  for alpha, beta, color in examples:
      u = ufunc(alpha)
      Vi = Vifunc(u)
      Vo = Vofunc(u)
      axu.plot(alpha, u,  "o", color=color, mec="k")
      axi.plot(alpha, Vi, "o", color=color, mec="k")
      axo.plot(alpha, Vo, "o", color=color, mec="k")

  for ax in axo, axi:
      ax.axhspan(0.0, CS, color="0.8", alpha=0.8, zorder=0)
      ax.axhline(CS, lw=0.7, ls="-", color="k", zorder=100)
  fig.legend(
      ncol=2,
      loc="upper right",
      bbox_to_anchor=(0.98, 0.72),
      fontsize="small",
  ).set_title(
      "Velocity ratio: " + r"$\beta = V_\mathrm{env}\, / \,V_\mathrm{jet}$",
  )

  axo.set(
      xscale="log",
      xlabel=r"Density ratio: $\alpha = \rho_{\mathrm{jet}} \, / \, \rho_{\mathrm{env}}$",
      ylabel=r"$V_\mathrm{s1}$, km / s",
      ylim=[0, 80],
  )
  axi.set(
      ylabel=r"$V_\mathrm{s2}$, km / s",
      ylim=[0, 200],
  )
  axu.set(
      ylabel=r"$u = V_\mathrm{WS} \, / \, V_\mathrm{jet}$",
      ylim=[0, None],
  )

  sns.despine()
  fig.tight_layout()
  fig.savefig(figfile)


#+end_src

#+RESULTS:
[[file:shock-velocities.pdf]]
 
** Magnetic field - Alfven speed versus sound speed

*** Talk about how H II regions are thermally dominated
+ Low Alfvén speed, compared with sound speed 
+ Need to consider jet shock (Mach disk) and H II region shock (bow shock) separately
  + Although if we are at an internal working surface, then this might not be an important distinction 
